## Question 1: Answer

In [ ]:
import sqlite3

In [ ]:
def add_data_to_database():
    try:
        # Connect to the database
        with sqlite3.connect('employees_data.db') as conn:
            cursor = conn.cursor()

           # Create the table
            cursor.execute('''
            CREATE TABLE IF NOT EXISTS employees (
                employee_id INTEGER PRIMARY KEY,
                employee_names TEXT,
                tasks_completed INTEGER,
                awards INTEGER
            )
            ''' )
            # Insert data into the table
            cursor.executemany('''
            INSERT INTO employees (employee_id, employee_names, tasks_completed, awards)
            VALUES (?, ?, ?, ?)
            ''', [
                (1, 'kenson', 4, 3),
                (2, 'John', 5, 3),
                (3, 'Peter', 12, 5),
                (4, 'John', 8, 4),
                (5, 'Kelly', 7, 4)
                ]
                )
            conn.commit()
            print("Table created successfully.")
    except Exception as e:
        print(f"Error: {e}")

# Calling the function
add_data_to_database()

Table created successfully.

In [ ]:
# Loading SQL extension
%load_ext sql

In [ ]:
# Connnecting to the database
%sql sqlite:///employees_data.db

In [ ]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [ ]:
%%sql
SELECT * FROM employees;

 * sqlite:///employees_data.db
Done.

[(1, 'kenson', 4, 3),
 (2, 'John', 5, 3),
 (3, 'Peter', 12, 5),
 (4, 'John', 8, 4),
 (5, 'Kelly', 7, 4)]

## Question 2 : **Answer**

In [ ]:
%%sql
SELECT
    COUNT(DISTINCT employee_names) AS unique_employees
FROM employees;

 * sqlite:///employees_data.db
Done.

[(4,)]

## Question 3: Answer

In [ ]:
%%sql
SELECT
      COUNT(*) AS over_10_tasks_completed
FROM (
    	SELECT
       		 employee_names,
        		SUM(tasks_completed) AS total_tasks_completed
   	    FROM employees
   	    GROUP BY employee_names
    	HAVING SUM(tasks_completed) > 10
) AS completed_tasks_count;

 * sqlite:///employees_data.db
Done.

[(2,)]

## Question 4: **Answer**

In [ ]:
%%sql
SELECT
    COUNT(*) AS count_of_names_start_with_jo
FROM (
        SELECT employee_names
        FROM employees
        WHERE employee_names LIKE 'Jo%'
        GROUP BY employee_names
        HAVING SUM(tasks_completed) > 10
) AS over_ten_tasks_completed;

 * sqlite:///employees_data.db
Done.

[(1,)]

## Question 5: **Answer**

In [ ]:
%%sql
SELECT
    employee_names,
    SUM(tasks_completed) AS total_tasks,
    MAX(awards)  AS total_awards
FROM employees
GROUP BY  employee_names
ORDER BY total_tasks DESC, total_awards DESC
LIMIT 1;

 * sqlite:///employees_data.db
Done.

[('John', 13, 4)]

## Question 6: **Answer**

In [ ]:
%%sql
SELECT
    employee_names,
    SUM(tasks_completed) AS total_tasks,
    MAX(awards)  AS total_awards
FROM employees
GROUP BY employee_names
HAVING total_tasks > 5 AND total_awards >= 5;

 * sqlite:///employees_data.db
Done.

[('Peter', 12, 5)]

In [ ]:
%%sql
SELECT
  employee_names,
  SUM(tasks_completed) AS total_tasks,
  MAX(awards) AS total_awards
FROM employees
GROUP BY employee_names
HAVING SUM(tasks_completed) > 5 AND MAX(awards) >= 5;

 * sqlite:///employees_data.db
Done.

[('Peter', 12, 5)]